Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: For the entire network to be backfillable by third parties at all is a novel concept for AT. Other, monolithic social networks generally only offer an large-scale event stream (like our firehose) from the current date and time, making it difficult to perform longitudinal data analysis without additional data vendors. With the AT Protocol and adequate resources, you can *always* backfill the entire network on your own. This, in turn, benefits researchers and other forms of data analysis — if you can provision enough storage, you can have your own local copy of the entire Atmosphere.
ja: ネットワーク全体が第三者によってバックフィル可能であることは、ATの画期的なコンセプトです。他のモノリシックなソーシャルネットワークは、一般にその時点からの大規模なイベントストリーム（firehoseのようなもの）のみを提供するため、追加のデータベンダーなしで縦断的なデータ分析を実行することが困難です。ATプロトコルと十分なリソースがあれば、*いつでも*ネットワーク全体を自分でバックフィルできます。これはさらに研究者やその他のデータ分析に利益をもたらします。十分なストレージを用意できれば、Atmosphere全体の独自のローカルコピーを持つことができます。

source: For this example, you'll be creating our entire app in a single file at `src/index.ts`. Create that file now, and add these imports and config lines:
ja: この例では、アプリ全体を`src/index.ts`という単一ファイルで作成します。このファイルを作成し、以下のimportと設定行を追加してください。

source: For users who are able to securely manage a private cryptographic keypair (eg, store in a password manager or digital wallet), it is recommended to include a self-controlled PLC rotation key (public key) in the PLC operation.
ja: 秘密鍵の鍵ペアを安全に管理できるユーザー（例：パスワードマネージャやデジタルウォレットに保存できる場合）は、PLCオペレーションに自己管理のPLCローテーション鍵（公開鍵）を含めることを推奨します。

source: For users, this should feel like visiting a page in the app. Once they subscribe to a custom algorithm, it will appear in their home interface as one of their available feeds.
ja: ユーザーにとって、これはアプリのページを訪問するような感覚です。カスタムアルゴリズムを登録すると、ホームインターフェースで利用可能なフィードの一つとして表示されます。

source: For your app's signup flow, you will need users to log in or create an account. We generally recommend hosting your own PDS alongside your app to allow first-time users of the Atmosphere — who may not yet be aware of the concept of a PDS — to sign up directly within your application. Your PDS and AppView should have [different domain names](/going-to-production#domain-names).
ja: アプリのサインアップフローでは、ユーザーがログインまたはアカウント作成を行う必要があります。Atmosphereを初めて利用するユーザー（まだPDSの概念を知らない可能性がある）に対してアプリ内で直接サインアップさせるため、アプリと一緒にPDSもホストすることを一般的に推奨します。PDSとAppViewは[異なるドメイン名](/going-to-production#domain-names)を使用してください。

source: Forever
ja: 永久

source: Forget the noise
ja: ノイズを忘れよう

source: Forgot Password
ja: パスワードを忘れた

source: Forgot password?
ja: パスワードを忘れた？

source: Forgot?
ja: 忘れた？

source: Free your feed
ja: フィードを解放しよう

source: Frequently Asked Questions about the Authenticated Transfer Protocol (AT Proto). For FAQ about Bluesky, visit [here](https://bsky.social/about/faq).
ja: Authenticated Transferプロトコル（ATプロトコル）に関するよくある質問。Blueskyに関するよくある質問については、[こちら](https://bsky.social/about/faq)をご覧ください。

source: Frequently Asked Questions about the Authenticated Transfer Protocol (Atproto). For FAQ about Bluesky, visit [here](https://bsky.social/about/faq).
ja: Authenticated Transferプロトコル（atproto）に関するよくある質問。Blueskyに関するよくある質問については、[こちら](https://bsky.social/about/faq)をご覧ください。

source: From
ja: 通知対象

source: From <0/>
ja: <0/>から

source: From @{sanitizedAuthor}
ja: @{sanitizedAuthor}による

source: From a user experience perspective, it's best to keep the number of requested permission sets low. Each additional permission set adds more information to the authorization dialog, which can lead to decision fatigue. It is possible to allow users to grant only a subset of requested permissions, but this can lead to edge cases.
ja: ユーザー体験の観点では、要求する権限セットの数は少なく保つのが望ましいです。権限セットが追加されるたびに認可ダイアログの情報量が増え、判断疲れにつながる可能性があります。ユーザーに要求権限の一部のみを付与させることもできますが、エッジケースを生む場合があります。

source: From another perspective, Osprey is a Python library for processing actions through human written rules and outputting labels, webhooks back to an API and other sinks. It evaluates events using structured logic, user-defined functions, and external signals to assign labels, verdicts, and actions. It can make use of fine-tuned LLMs and other classifiers that expose their own web endpoints to Osprey. LLMs can be a useful tool for surfacing moderation reports; these reports can be acted on automatically and/or manually depending on your configuration.
ja: 別の見方をすれば、Ospreyは人間が記述したルールを通じてアクションを処理し、ラベルを発行したりAPIへのwebhookを出力したりするためのPythonライブラリです。構造化されたロジック、ユーザー定義関数、外部シグナルを用いてイベントを評価し、ラベル・判定・アクションを割り当てます。微調整されたLLMや他の分類器をOspreyのエンドポイントとして利用することも可能で、モデレーション報告の抽出に役立ちます。これらの報告は設定に従って自動または手動で処理されます。

source: From here, you can begin configuring your Labeler service.
ja: ここから、ラベラーサービスの設定を開始できます。

source: From here, you can go directly to [making API requests](/guides/reads-and-writes).
ja: ここから直接[APIリクエストの作成](/guides/reads-and-writes)に進めます。

source: From here, you can run `lex build` to generate TypeScript types for all of your installed Lexicons:
ja: ここから`lex build`を実行すると、インストール済みLexiconすべてに対してTypeScriptの型を生成できます。

source: From here, you would need to read each message as it comes in, and decode the associated data. Our [Go](https://github.com/bluesky-social/indigo) SDK is currently the most feature-complete for interacting with the firehose directly.
ja: ここから、入ってくる各メッセージを読み込み、関連するデータをデコードする必要があります。当社の[Go](https://github.com/bluesky-social/indigo) SDKは、現在firehoseと直接対話するには最も機能が揃っています。

source: From the expanded ATProto and Bluesky permissions, you might recognize `atproto` (for OAuth login), `blob:*/*` (for image and video handling), and several other `app.bsky.*` permissions for profile and social graph interactions.
ja: 展開されたATプロトコルとBlueskyの権限には、OAuthログイン用の`atproto`、画像・動画の取り扱い用の`blob:*/*`、そしてプロフィールやソーシャルグラフ操作のための複数の`app.bsky.*`権限が含まれていることが分かるでしょう。

source: From the expanded Atproto and Bluesky permissions, you might recognize `atproto` (for OAuth login), `blob:*/*` (for image and video handling), and several other `app.bsky.*` permissions for profile and social graph interactions.
ja: 展開されたatprotoとBlueskyの権限には、OAuthログイン用の`atproto`、画像・動画の取り扱い用の`blob:*/*`、そしてプロフィールやソーシャルグラフ操作のための複数の`app.bsky.*`権限が含まれていることが分かるでしょう。

source: From there, the event gets sent to any view services that are listening &mdash; including our own!
ja: そこから、イベントはリッスンしているすべてのビューサービスに送信されます。これには、私たち自身のサービスも含まれます。

source: From this basis, atproto adds two core innovations: identity-based authority and the separation of data hosting from the rich applications built on top of it.
ja: この基盤の上に、atprotoは2つの核となるイノベーションを加えます。IDに基づく権威と、データホスティング層をその上のリッチなアプリケーションから分離することです。

source: Full-featured client apps require a large number of granular permissions to function: dozens or even hundreds of individual permissions. To simplify permission management, Lexicon designers can define "sets" of permissions as part of the schemas they publish. These permission sets are themselves Lexicon schemas and are referred to by namespace ID, such as `com.example.authBasicFeatures`.
ja: フル機能のクライアントアプリは、多数の細かな権限（数十、場合によっては数百）を必要とします。権限管理を簡素化するために、Lexicon設計者は公開するスキーマの一部として権限の集合を定義できます。これらの権限セット自体もLexiconスキーマであり、`com.example.authBasicFeatures`のような名前空間IDで参照されます。

source: Generate a starter pack
ja: スターターパックを生成

source: Get help
ja: ヘルプを表示

source: Get notifications when people follow you.
ja: フォローされたときに通知を受け取る。

source: Get notifications when people like posts that you've reposted.
ja: リポストした投稿をいいねされたら通知を受け取る。

source: Get notifications when people like your posts.
ja: 投稿をいいねされたら通知を受け取る。

source: Get notifications when people mention you.
ja: メンションされたら通知を受け取る。

source: Get notifications when people quote your posts.
ja: 投稿を引用されたら通知を受け取る。

source: Get notifications when people reply to your posts.
ja: 投稿に返信があったら通知を受け取る。

source: Get notifications when people repost posts that you've reposted.
ja: リポストした投稿をリポストされたら通知を受け取る。

source: Get notifications when people repost your posts.
ja: 投稿をリポストされたら通知を受け取る。

source: Get notified about new posts
ja: 新しい投稿の通知を受け取る

source: Get notified about posts and replies from accounts you choose.
ja: 選択したアカウントの投稿と返信の通知を受け取る。

source: Get notified of new posts from {name}
ja: {name} の新しい投稿の通知を受け取る

source: Get notified of this account’s activity
ja: このアカウントのアクティビティの通知を受け取る

source: Get notified when someone posts
ja: 誰かが投稿したときに通知を受け取る

source: Get notified when {name} posts
ja: {name} が投稿した時に通知を受け取る

source: Get started
ja: 開始

source: Getting started
ja: 入門

source: Give your profile a face
ja: プロフィールに顔をつける

source: Given a DID, check your current 'revision' for that DID (Each change to a repo is tagged with a 'revision' or 'rev' string that is a lexicographically sortable timestamp).
ja: DIDが与えられた場合、そのDIDの現在のリビジョンを確認します（リポジトリへのすべての変更は、辞書順でソート可能なタイムスタンプである「rev」文字列でタグされます）。

source: Glorification of violence
ja: 暴力の賛美

source: Go Back
ja: 戻る

source: Go Home
ja: ホームへ

source: Go Live
ja: ライブ開始

source: Go back
ja: 戻る

source: Go back to previous step
ja: 前のステップに戻る

source: Go home
ja: ホームへ

source: Go live
ja: ライブ開始

source: Go live for
ja: ライブ予定時間

source: Go to [docs.bsky.app](https://docs.bsky.app) for Bluesky-specific documentation.
ja: Bluesky固有のドキュメントについては、[docs.bsky.app](https://docs.bsky.app)にアクセスしてください。

source: Go to account settings
ja: アカウント設定へ移動

source: Go to conversation with {0}
ja: {0}との会話へ

source: Go to feed
ja: フィードへ移動

source: Go to next
ja: 次へ

source: Go to profile
ja: プロフィールへ

source: Go to user's profile
ja: ユーザーのプロフィールへ移動

source: Go to {firstAuthorName}'s profile
ja: {firstAuthorName}のプロフィールに移動

source: Graphic Media
ja: 生々しいメディア（グロ・事故・戦争・災害等）

source: Graphic violent content
ja: 露骨な暴力的コンテンツ

source: Great! Also, since we're going to be syncing these records around the Internet, it would be a good idea to cryptographically sign them so that we know they're authentic.
ja: すばらしい！また、これらのレコードをインターネット上で同期するため、本物であることを確認するために暗号署名することをお勧めします。

source: Grooming or predatory behavior
ja: グルーミングまたは捕食的行為（性的搾取目的の接近）

source: Hacking or system attacks
ja: ハッキングまたはシステム攻撃

source: Half way there!
ja: 半分まで来ました！

source: Handle
ja: ハンドル

source: Handle already taken. Please try a different one.
ja: ハンドルはすでに取得されています。他のものをお試しください。

source: Handle changed!
ja: ハンドルを変更しました！

source: Handle resolution uses either a DNS TXT record, or an HTTPS well-known endpoint. Details can be found in the [Handle specification](/specs/handle).
ja: ハンドル解決には、DNSのTXTレコードか、HTTPSのwell-knownエンドポイントを利用します。詳細は[ハンドル仕様](/specs/handle)を参照してください。

source: Handle too long. Please try a shorter one.
ja: ハンドルが長すぎます。短いものをお試しください。

source: Handles are domain names which are used to identify [data repos](#data-repo). More than one handle may be assigned to a repo. Handles may be used in `at://` URIs in the domain segment.
ja: ハンドルは、[データリポジトリ](#data-repo)を識別するために使用されるドメイン名です。リポジトリには複数のハンドルを割り当てることができます。ハンドルは、ドメインセグメントの`at://` URIで使用できます。

source: Handles in atproto are domain names which resolve to a DID, which in turn resolves to a DID Document containing the user's signing key and hosting service.
ja: atprotoのハンドルは、DIDに解決されるドメイン名です。DIDは、ユーザーの署名公開鍵とホスティングサービスを含むDIDドキュメントに解決されます。

source: Haptics
ja: 触覚フィードバック

source: Harassment or hate
ja: 嫌がらせまたはヘイト

source: Harassment: `blurs=content` + `severity=alert`
ja: ハラスメント：`blurs=content` + `severity=alert`

source: Harmful or high-risk activities
ja: 有害または高リスクの活動

source: Harming or endangering minors
ja: 未成年者への危害または危険行為

source: Hashtag
ja: ハッシュタグ

source: Hashtag {tag}
ja: ハッシュタグ {tag}

source: Hate speech
ja: ヘイトスピーチ

source: Have a code? <0>Click here.</0>
ja: コードがありませんか？<0>ここをクリックしてください。</0>

source: Having trouble?
ja: なにか問題が発生しましたか？

source: Held by Bluesky for 7 days to prevent abuse, then deleted
ja: 乱用を防ぐために7日間、Blueskyが保持し、それから削除しました

source: Help
ja: ヘルプ

source: Help people know you're not a bot by uploading a picture or creating an avatar.
ja: 画像をアップロードするかアバターを作ってあなたがbotではないことをみんなに知らせましょう。

source: Here are some guidelines, by data type:
ja: 以下は、データ型別のガイドラインです。

source: Here are some recommended conventions and best practices for designing Lexicon schemas.
ja: Lexiconスキーマの設計に関する推奨される慣例とベストプラクティスを紹介します。

source: Here is a Python example:
ja: Pythonの例を次に示します。

source: Here is your app password!
ja: アプリパスワードをお知らせします！

source: Here's how it's going to look:
ja: 次のようになります。

source: Here, you connect to `tap`, and use the `SimpleIndexer` function provided by the `@atproto/tap` library to process incoming records from the `app.bsky.feed.post` Lexicon — i.e., Bluesky posts.
ja: ここでは`tap`に接続し、`@atproto/tap`ライブラリの`SimpleIndexer`関数を使って`app.bsky.feed.post` Lexicon、つまりBluesky投稿の受信レコードを処理しています。

source: Here, you're using `LexRouter` from the `@atproto/lex-server` package to define your XRPC routes. You'll notice that the `getFeedSkeleton` method returns a `cursor` in its response and takes a `cursor` param as input. This allows clients to paginate through your feed.
ja: ここでは`@atproto/lex-server`パッケージの`LexRouter`を使ってXRPCルートを定義しています。`getFeedSkeleton`メソッドはレスポンスで`cursor`を返し、入力としても`cursor`パラメータを受け取ります。これによりクライアントはフィードをページネーションできます。

source: Hey there 👋
ja: こんにちは👋

source: Hey there!
ja: やあ！

source: Hi there!
ja: こんにちは！

source: Hidden
ja: 非表示

source: Hidden by your moderation settings.
ja: あなたのモデレーションの設定で非表示になっています。

source: Hidden list
ja: 非表示のリスト

source: Hide
ja: 非表示

source: Hide customization options
ja: カスタマイズオプションを非表示

source: Hide lists
ja: リストを非表示にする

source: Hide post for me
ja: 投稿を自分には非表示

source: Hide reply for everyone
ja: 返信を全員に非表示

source: Hide reply for me
ja: 返信を自分には非表示

source: Hide this card
ja: このカードを非表示

source: Hide this post?
ja: この投稿を非表示にしますか？

source: Hide this reply?
ja: この返信を非表示にしますか？

source: Hide trending topics
ja: トレンド・トピックを非表示にする

source: Hide trending topics?
ja: トレンド・トピックを非表示にしますか？

source: Hide trending videos?
ja: トレンド・ビデオを非表示にしますか？

source: Hide user list
ja: ユーザーリストを非表示

source: Hide verification badges
ja: 認証バッジを非表示

source: Hides the content
ja: コンテンツを非表示

source: Historical backfill: Tap fetches the full repo from the account's PDS using com.atproto.sync.getRepo
ja: 履歴バックフィル：Tapはcom.atproto.sync.getRepoを使用して、対象アカウントのPDSから完全なリポジトリをフェッチします。

source: Hmm, it looks like you're logged in with an <0>App Password</0>. To set your birthdate, you'll need to log in with your main account password, or ask whomever controls this account to do so.
ja: うーん、<0>アプリパスワード</0>でログインしているようです。 生年月日を設定するには、メインのアカウントのパスワードでログインするか、アカウントを管理している人に尋ねる必要があります。

source: Hmm, some kind of issue occurred when contacting the feed server. Please let the feed owner know about this issue.
ja: フィードサーバーに問い合わせたところ、なんらかの問題が発生しました。この問題をフィードのオーナーにお知らせください。

source: Hmm, the feed server appears to be misconfigured. Please let the feed owner know about this issue.
ja: フィードサーバーの設定が間違っているようです。この問題をフィードのオーナーにお知らせください。

source: Hmm, the feed server appears to be offline. Please let the feed owner know about this issue.
ja: フィードサーバーがオフラインのようです。この問題をフィードのオーナーにお知らせください。

source: Hmm, the feed server gave a bad response. Please let the feed owner know about this issue.
ja: フィードサーバーの反応が悪いようです。この問題をフィードのオーナーにお知らせください。

source: Hmm, we're having trouble finding this feed. It may have been deleted.
ja: このフィードが見つからないようです。もしかしたら削除されたのかもしれません。

source: Hmmmm, it seems we're having trouble loading this data. See below for more details. If this issue persists, please contact us.
ja: このデータの読み込みに問題があるようです。詳細は以下をご覧ください。この問題が解決しない場合は、サポートにご連絡ください。

source: Hmmmm, we couldn't load that moderation service.
ja: そのモデレーションサービスを読み込めませんでした。

source: Hold up! We’re gradually giving access to video, and you’re still waiting in line. Check back soon!
ja: 待って！徐々にビデオへのアクセスを許可していますが、あなたの順番はまだです。しばらくしてもう一度確認を！

source: Home
ja: ホーム

source: Host:
ja: ホスト：

source: Hosting provider
ja: ホスティングプロバイダー

source: Hosting your own AppView or Relay is possible, but resource intensive. Compared with hosting your own PDS, which is a way of personally controlling access to your own data repository, hosting an AppView or Relay is something that you would only do to provide application-level infrastructure. Generally, the first thing you would need to do here is replicate all of the data in the network for the Lexicons that your application handles. Refer to the [Sync](/guides/sync) docs for a starting point.
ja: 独自のAppViewやリレーをホスティングすることは可能ですが、リソースを大量に消費します。自身のデータリポジトリへのアクセスを個人的に制御する手段であるPDSのホスティングと比較すると、AppViewやリレーのホスティングはアプリケーションレベルのインフラを提供するために行うものです。通常は必要なLexiconに関するネットワーク上の全データを複製することが最初の作業になります。始めるには[同期](/guides/sync)のドキュメントを参照してください。

source: Hot
ja: ホット

source: How a feed generator fulfills the `getFeedSkeleton` request is completely at their discretion. At the simplest end, a Feed Generator could supply a "feed" that only contains some hardcoded posts.
ja: `getFeedSkeleton`リクエストに対してフィードジェネレーターがどのように埋めるかは完全にその裁量に任されています。最も単純な場合、フィードジェネレーターはハードコードされた投稿のみを含むフィードを提供できます。

source: How can we do that? If we look at our diagram, we can see that most of the system is isolated from the outside world, with only the App server providing a public interface.
ja: どうすればそれができるでしょうか。図を見ると、システムの大部分が外部から分離されており、アプリサーバーのみがパブリックインターフェイスを提供していることがわかります。

source: How it works:
ja: 仕組み：

source: How should we open this link?
ja: このリンクをどのように開きますか？

source: How we use your number:
ja: 私達はあなたの電話番号をどう扱うか：

source: However, **if the self-hoster is confident they will retain ownership of the domain name**, they can use `did:web` instead of `did:plc`:
ja: ただし、**セルフホストする人がドメイン名の所有権を保持し続けられると確信している場合**、`did:plc`ではなく`did:web`を使用できます。

source: However, the new account is not yet "active".
ja: ただし、新しいアカウントはまだ有効ではありません。

source: However, the sheer volume of data and the compute required to support these platforms cannot be handled by a single machine. Therefore even within a given platform's deployment, work must be split up across many machines. A common pattern is to peel off pieces of the application into smaller “micro-services” that can call into one another and then compose these micro-services into the larger platform. By isolating the concerns of each subsystem, teams can scale each according to its particular needs. For example, feed generation looks very different from video transcoding, and these workloads can benefit from being hosted on machines tailored to their workload.
ja: しかし、これらのプラットフォームを支える膨大なデータ量と計算量は、単一のマシンでは処理できません。したがって、ひとつのプラットフォームのデプロイ内でも作業は多数のマシンに分割する必要があります。よくあるパターンは、アプリケーションを小さな「マイクロサービス」に切り出し、それらが相互に呼び出し合いながら大きなプラットフォームを構成することです。各サブシステムの関心を分離することで、チームはそれぞれの必要に応じてスケールできます。例えば、フィード生成と動画トランスコードは大きく異なるため、それぞれに適したマシンでホストすることで恩恵を得られます。

source: Human trafficking
ja: 人身売買

source: I consent to Bluesky using my contacts for mutual friend discovery and to retain hashed data for matching until I opt out.
ja: 私がオプトアウトするまで、相互の友人を発見するためにBlueskyが私の連絡先を使用し、マッチングのためのハッシュ化されたデータをBlueskyが保持することに同意します。

source: I have a code
ja: コードを持っています

source: I have my own domain
ja: 自分のドメインを持っています

source: I understand
ja: 理解した

source: I'm on Bluesky as {0} - come find me! https://bsky.app/download
ja: 私は {0} としてBlueskyにいます。私を見つけて！ https://bsky.app/download

source: Identities are long-lived and untethered from any location where they may currently be housed. The primacy that data has in p2p networks is moved up the stack to identity. Identities exist independent of any given host or application and can move between them fluidly. Data in the network then flows from these identities with a well-defined mechanism of how to resolve the identity to some set of data and receive real time updates as new content is created.
ja: IDは長期間維持され、今いる場所から切り離されています。P2Pネットワークではデータが主体ですが、このスタックの主体はIDへと移ります。IDは特定のホストやアプリケーションに依存せずに存在し、それらの間を流動的に移動できます。ネットワーク内のデータはこれらのIDが源流となり、IDをデータの集まりに解決する仕組みと、新しいコンテンツが生成された際にリアルタイム更新を受け取る仕組みが明確に定義されています。

source: Identities themselves resolve to key material that can verify the authenticity of that identity's data as well as a particular host that consumers can reach out to to get the canonical current state of the identity's data. These canonical hosts of user data are known as Personal Data Servers (PDSs).
ja: IDは、そのIDのデータの真正性を検証できる鍵材料と、消費者がそのIDデータの正規の最新状態を取得するための特定のホストへ解決されます。これらのユーザーデータの正規ホストは、パーソナルデータサーバー（PDS）として知られています。

source: If a lexicon must change a previously-published constraint, it should be published as a new lexicon under a new NSID.
ja: Lexiconで以前に発行された制約を変更する必要がある場合は、新しいNSIDの下で新しいLexiconとして発行する必要があります。

source: If alt text is long, toggles alt text expanded state
ja: ALTテキストが長い場合、ALTテキストの展開状態を切り替える

source: If an endpoint is experimental, unstable, or not intended for interoperability, indicate that in the NSID name
ja: エンドポイントが実験的、不安定、または相互運用を意図していない場合は、NSID名に示してください

source: If an individual record fails to validate for any reason, the entire record should be ignored, but other records from the same repository should be processed. If there is a problem with the repository commit data or repository structure ("MST"), the repository should be marked as invalid, but old content does not need to be de-indexed or purged. As soon as a new valid commit is received, the repository should be marked valid again. This logic is mostly relevant to feed generators, AppViews, and moderation services, all of which may be consuming from the firehose.
ja: 個別のレコードが何らかの理由でバリデーションに失敗した場合、レコード全体は無視されるべきですが、同じリポジトリの他のレコードは処理される必要があります。リポジトリのコミットデータまたはリポジトリ構造（MST）に問題がある場合、リポジトリは無効としてマークされるべきですが、古いコンテンツはインデックスからの除外や削除をする必要はありません。新しい有効なコミットが受け取られたら、リポジトリはすぐに有効としてマークされます。このロジックはフィードジェネレーター、AppView、およびモデレーションサービスといったfirehose利用者に主に関連しています。

source: If limiting the length of a string for semantic or visual reasons, grapheme limits should be used to ensure a degree of consistency across human languages. A data size (bytes) limit should also be added in these cases. A ratio of between 10 to 20 bytes to 1 grapheme is recommended.
ja: 意味的または視覚的な理由で文字列の長さを制限する場合、書記素制限を使用して言語間である程度の一貫性を確保するべきです。この場合、データサイズ（バイト）の制限も追加してください。1書記素あたり10〜20バイトの比率が推奨されます。

source: If needed, ensure that this script also runs on SIGTERM when cleaning up containers or pods from your deployment.
ja: 必要に応じて、デプロイメントからコンテナまたはポッドをクリーンアップするときに、このスクリプトがSIGTERMでも実行されるようにしてください。

source: If this sounds exciting to you, you can dive in further by checking out the [protocol specs](https://atproto.com/specs/atp), or getting hands on with the [Statusphere](https://github.com/bluesky-social/statusphere-example-app) example app built on the protocol.
ja: 興味があるなら、[プロトコル仕様](https://atproto.com/specs/atp)を読んだり、このプロトコル上に構築された[Statusphere](https://github.com/bluesky-social/statusphere-example-app)のサンプルアプリで実際に触れてみてください。

source: If we can relax our system to use “[eventual consistency](https://en.wikipedia.org/wiki/Eventual_consistency),” we can scale much further. We start by switching to a NoSQL cluster.
ja: システムを緩和して[結果整合性](https://en.wikipedia.org/wiki/Eventual_consistency)を使用できれば、さらに拡張できます。まず、NoSQLクラスターに切り替えます。

source: If you are building a client or another interface that both reads and writes data, it is important to ensure that you read your own writes using this response.
ja: データの読み書き両方を行うクライアント等のインターフェースを構築している場合は、この応答を使用して書き込んだものを確実に読み取ることが重要です。

source: If you are implementing backfilling on your own, the general process is:
ja: バックフィルを自分で実装する場合、一般的なプロセスは次のとおりです。

source: If you are making use of Bluesky profile information, you may also need: - `rpc:app.bsky.actor.getProfile?aud=did:web:api.bsky.app#bsky_appview`
ja: Blueskyのプロフィール情報を利用したいなら、以下も必要になることがあります。 - `rpc:app.bsky.actor.getProfile?aud=did:web:api.bsky.app#bsky_appview`

source: If you are moving your account from one PDS (such as a Bluesky-hosted PDS) to another, refer to [Account Migration](/guides/account-migration).
ja: アカウントをあるPDS（例：BlueskyがホストするPDS）から別のPDSに移行する場合は、[アカウント移行](/guides/account-migration)を参照してください。

source: If you are not yet an adult according to the laws of your country, your parent or legal guardian must read these Terms on your behalf.
ja: あなたがお住いの国の法律においてまだ成人していない場合は、親権者または法定後見人があなたに代わって本規約をお読みください。
